import React, { FC } from 'react';

const Terms: FC = () => (
  <div className="prose m-auto my-4 w-11/12 max-w-4xl">
    <h1>利用規約</h1>
    <p>
      mesimasi(mesimasi.com)（以下、「当サイト」とします。）における免責事項は、下記の通りです。
    </p>
    <h2>当サイトの情報の正確性について</h2>
    <p>
      当サイトのコンテンツや情報において、可能な限り正確な情報を掲載するよう努めています。しかし、誤情報が入り込んだり、情報が古くなったりすることもあります。必ずしも正確性を保証するものではありません。また合法性や安全性なども保証しません。また、内容に関してはすべて個人の見解であるため、必ずしも正しいわけではありません。
    </p>
    <h2>損害等の責任について</h2>
    <p>
      当サイトの利用により生じた損害等の一切の責任を負いかねますので、ご了承ください。
      また当サイトからリンクやバナーなどによって他のサイトに移動された場合、移動先サイトで提供される情報、サービス等について一切の責任も負いません。
      当サイトの保守、火災、停電、その他の自然災害、ウィルスや第三者の妨害等行為による不可抗力によって、当サイトによるサービスが停止したことに起因して利用者に生じた損害についても、何ら責任を負うものではありません。
      当サイトを利用する場合は、自己責任で行う必要があります。
    </p>
    <h2>非個人情報の取扱について</h2>
    <p>
      当サイトでは、サイトの分析と改善のためにGoogle
      Analyticsを使用しています。その際、データ収集のためにGoogleがお使いのブラウザにcookieを設定したり、読み取ったりする場合があります。また、当サイトをご利用中のwebブラウザはGoogleに特定の非個人情報を自動的に送信します。当サイトはそれらを、サイト利用状況の把握やユーザーの傾向をコンテンツとして公開する用途で使用する可能性があります。ユーザーは当サイトにアクセスすることで上記方法及び目的に同意・許可したものとみなします。
    </p>
    <h2>当サイトで掲載している画像の著作権や肖像権等について</h2>
    <p>
      当サイトで掲載している画像の著作権や肖像権等は、各権利所有者に帰属します。万が一問題がある場合は、下記Twitterアカウントまでご連絡いただけますよう宜しくお願い致します。
    </p>
    <a href="https://twitter.com/masibw">https://twitter.com/masibw</a>
  </div>
);

export default Terms;
